import UserList from './components/UserList';
import info from './info.json'
import './App.css'

console.log(info);


// Створіть React-додаток, який відображатиме список користувачів.
// Використовуйте масив об'єктів користувачів для відображення інформації про кожного користувача.
// Створіть новий функціональний компонент User, який буде приймати об'єкт користувача як пропс.
// Відображайте ім'я, вік та місто користувача.
// Створіть новий функціональний компонент UserList, який прийматиме масив об'єктів користувачів як пропс.
// У компоненті UserList використовуйте map для ітерації через масив користувачів та створення компонентів User для кожного користувача. Виводьте список створених компонентів User.
// Відобразіть компонент UserList в кореневому компоненті App.


function App() {
 

  return (
    <>

      <UserList users={info}/>

    </>
  )
}

export default App
